{
    "projects": [
        {
            "title": "HR Management System",
            "description": "Developed a HR assistant web application that digitized the HR department processes such as onboarding, leave management, performance appraisal and employee management at WEC.",
            "githubLink": "https://github.com/benard-dev/wec-hr-management-system",
            "skills": ["React", "TailwindCSS"],
            "coverImage": "assets/Projects/hrms-preview.gif",
            "openSource": true,
            "startDate": "January 2023",
            "endDate": "April 2023"
        },
        {
            "title": "WEC Company Website",
            "description": "Creating the Willfreight company website was an exciting project that involved collaboration between me and the client. I worked closely with Willfreight to develop a modern and user-friendly website that effectively showcases their services, values, and company culture, while providing a seamless user experience for visitors.",
            "githubLink": "https://github.com/benard-dev/wec-company-website",
            "skills": ["React", "TailwindCSS"],
            "coverImage": "assets/Projects/wcw-preview.gif",
            "openSource": true,
            "startDate": "April 2023",
            "endDate": "Present"
        }
    ],
    "blogs": [
        {
            "title": "My Journey as a Software Developer Starts",
            "teaserContent": "So, I have been coding relentlessly for the past three months, and I've been able to see some significant progress. Just check out this Github contribution graph. Isn't it beautiful? Especially considering it's just April...",
            "coverImage": "assets/Blog/streaks.png",
            "link": "https://dev.to/benard-dev"
        }
    ],
    "work-history": [
        {
            "company": "Willfreight Express Cargo Services",
            "position": "Software Engineer Intern",
            "description": "During my 12-week internship at Willfreight, a freight and logistics company, I worked on developing a human resource management system. I collaborated with mentors and team members to ensure timely delivery of the project.",
            "startDate": "January 2023",
            "endDate": "April 2023",
            "logo": "assets/WorkHistory/wec-logo.jpg",
            "link": "https://www.willfreight.com"
        },
        {
            "company": "Strathmore School",
            "position": "Teaching Assistant, Computer Lab",
            "description": "As a teaching assistant for the computer lab at Strathmore School, I assisted in the delivery of computer-based instruction to students. My responsibilities included setting up and maintaining computer equipment, monitoring student progress, and providing individualized assistance to students as needed. I played a key role in ensuring the smooth functioning of the computer lab and facilitating student learning.",
            "startDate": "January 2021",
            "endDate": "April 2021",
            "logo": "assets/WorkHistory/strath-logo.png",
            "link": "https://www.strathmore.ac.ke/"
        }
    ]
}